{
  "title": "Tournaments",
  "empty": "No events are available at the moment",
  "deadline": "Registration deadline",
  "note": "Note",
  "types": {
    "individual": "Individual",
    "group": "Group"
  },
  "gdpr": {
    "label": "I agree with",
    "link": "sign up conditions",
    "modal": {
      "title": "Sign up conditions",
      "opening": "By signing up to a Debate League tournament organized by Asociace debatních klubů, z.s. (Czech Debate Association), IN 69058041, based at U Vinohradské nemocnice 2255/6, 130 00 Prague 3 (hereinafter referred to as “the Association”), I give my consent to the:",
      "list": [
        "processing of the following personal data for the purpose of member evidence of the Association and evidence of debate competitions results;",
        "display of my name, surname, and my results in the Association’s competitions on the Association’s webpage;",
        "transfer of my name, surname, date of birth, permanent residence address, and ID card (passport) number to the accommodation provider at events that the Association holds and to the Association’s partner organizations in case they hold an event that I sign up to through the Association;",
        "taking pictures or audio-video recordings of my speeches made at the Association’s events and to the use of such recordings for educational purposes or Association’s promotion."
      ],
      "closing": "I take into consideration the fact that I can withdraw this personal data processing consent via a letter or email addressed to the Association’s president whenever I would deem it necessary. The withdrawal of the consent can mean that I shall not be allowed to participate in certain Association’s events and my results in the Association’s competitions shall not be calculated.\n"
    }
  },
  "fields": {
    "name": "Name",
    "surname": "Surname",
    "birthdate": "Date of birth",
    "birthDay": "Day",
    "birthMonth": "Month",
    "birthYear": "Year",
    "id_number": "ID number",
    "street": "Street and number",
    "city": "City",
    "zip": "ZIP code (PSČ)",
    "phone": "Phone number",
    "vegetarian": "Vegetarian",
    "accommodation": "I don't need accommodation",
    "legalGuardian": "Legal guardian",
    "parentName": "Full name",
    "parentPhone":  "Phone number",
    "parentEmail": "E-mail address",
    "note": "Note"
  },
  "fieldNotes": {
    "id_number": "Please fill in your ID number if you have one.",
    "accommodation": "Use the note field bellow for special accommodation requirements."
  },
  "registrationFields": {
    "accommodation": "Accomodation",
    "role": "Role",
    "teamName": "Team"
  },
  "autofill": {
    "title": "Autofill data of previously registered people",
    "empty": "You have no people to autofill.",
    "notLoggedIn": {
      "pre": "You need to",
      "signUp": "sign up",
      "or": "or",
      "login": "login",
      "post": " before being able to autofill data."
    }
  }
}